/* eslint-disable no-dupe-keys */
/* eslint-disable quote-props */
/* eslint-disable max-len */
/* eslint-disable import/prefer-default-export */
export function transliterate(word, ru) {
  const a = {
    'Ё': 'E', 'Й': 'I', 'Ц': 'TS', 'У': 'U', 'К': 'K', 'Е': 'E', 'Н': 'N', 'Г': 'G', 'Ш': 'SH', 'Щ': 'SCH', 'З': 'Z', 'Х': 'H', 'Ъ': "'", 'ё': 'e', 'й': 'i', 'ц': 'ts', 'у': 'u', 'к': 'k', 'е': 'e', 'н': 'n', 'г': 'g', 'ш': 'sh', 'щ': 'sch', 'з': 'z', 'х': 'h', 'ъ': "'", 'Ф': 'F', 'Ы': 'I', 'В': 'V', 'А': 'a', 'П': 'P', 'Р': 'R', 'О': 'O', 'Л': 'L', 'Д': 'D', 'Ж': 'ZH', 'Э': 'E', 'ф': 'f', 'ы': 'i', 'в': 'v', 'а': 'a', 'п': 'p', 'р': 'r', 'о': 'o', 'л': 'l', 'д': 'd', 'ж': 'zh', 'э': 'e', 'Я': 'Ya', 'Ч': 'CH', 'С': 'S', 'М': 'M', 'И': 'I', 'Т': 'T', 'Ь': "'", 'Б': 'B', 'Ю': 'YU', 'я': 'ya', 'ч': 'ch', 'с': 's', 'м': 'm', 'и': 'i', 'т': 't', 'ь': "'", 'б': 'b', 'ю': 'yu',
  };
  const b = {
    'U': 'У', 'K': 'К', 'E': 'Е', 'N': 'Н', 'G': 'Г', 'SH': 'Ш', 'SCH': 'Щ', 'Z': 'З', 'H': 'Х', 'yo': 'ё', 'i': 'й', 'ts': 'ц', 'u': 'у', 'k': 'к', 'e': 'е', 'n': 'н', 'g': 'г', 'sh': 'ш', 'sch': 'щ', 'z': 'з', 'h': 'х', 'F': 'Ф', 'V': 'В', 'a': 'А', 'P': 'П', 'R': 'Р', 'O': 'О', 'L': 'Л', 'D': 'Д', 'f': 'ф', 'v': 'в', 'a': 'а', 'p': 'п', 'r': 'р', 'o': 'о', 'l': 'л', 'd': 'д', 'S': 'С', 'M': 'М', 'I': 'И', 'T': 'Т', 'B': 'Б', 's': 'с', 'm': 'м', 'i': 'и', 't': 'т', 'b': 'б',
  };
  const str = ru ? a : b;
  return word.split('').map((char) => str[char] || char).join('');
}
